import { RGBColor } from 'src/surface/RGBColor';

export type SurfaceEntry = [number, RGBColor];
export const surfaceEntries: SurfaceEntry[] = [
  [0, [0, 0, 0]], // бездна
  [0.30, [0, 0, 139]], // впадины
  [0.42, [0, 0, 255]], // океаны
  [0.47, [0, 191, 255]], // прибрежные воды
  [0.50, [244, 164, 96]], // берег
  [0.54, [0, 100, 0]], // низменость
  [0.59, [0, 128, 0]], // равнина
  [0.75, [34, 139, 34]], // предгорье
  [0.80, [128, 128, 128]], // горы
  [1, [245, 230, 230]], // снега
  [1.2, [250, 240, 240]], // пики
  [2, [255, 255, 255]], // суперпики
];
